@zhelding I just uploaded my changes for physical_table_map as a set. However when I run the code I get an error: 

```
▶ make testacc TESTS=TestAccQuickSightDataSet_basic PKG=quicksight
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./internal/service/quicksight/... -v -count 1 -parallel 20 -run='TestAccQuickSightDataSet_basic' -timeout 180m
=== RUN   TestAccQuickSightDataSet_basic
=== PAUSE TestAccQuickSightDataSet_basic
=== CONT  TestAccQuickSightDataSet_basic
    data_set_test.go:25: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:


        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place

        Terraform will perform the following actions:

          # aws_quicksight_data_set.dset will be updated in-place
          ~ resource "aws_quicksight_data_set" "dset" {
                id             = "264522182925/tf-acc-test-4064235328383894385"
                name           = "tf-acc-test-4480227932746657673"
                # (5 unchanged attributes hidden)



              - physical_table_map {
                  - physical_table_map_id = "s3PhysicalTable" -> null

                  - s3_source {
                      - data_source_arn = "arn:aws:quicksight:us-west-2:264522182925:datasource/tf-acc-test-4064235328383894385" -> null

                      - input_columns {
                          - name = "ColumnId-1" -> null
                          - type = "STRING" -> null
                        }

                      - upload_settings {
                          - contains_header = true -> null
                          - format          = "JSON" -> null
                          - start_from_row  = 0 -> null
                          - text_qualifier  = "DOUBLE_QUOTE" -> null
                        }
                    }
                }
              + physical_table_map {
                  + physical_table_map_id = "tf-acc-test-4064235328383894385"

                  + s3_source {
                      + data_source_arn = "arn:aws:quicksight:us-west-2:264522182925:datasource/tf-acc-test-4064235328383894385"

                      + input_columns {
                          + name = "ColumnId-1"
                          + type = "STRING"
                        }

                      + upload_settings {
                          + contains_header = (known after apply)
                          + delimiter       = (known after apply)
                          + format          = (known after apply)
                          + start_from_row  = (known after apply)
                          + text_qualifier  = (known after apply)
                        }
                    }
                }
                # (2 unchanged blocks hidden)
            }

        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccQuickSightDataSet_basic (46.62s)
FAIL
FAIL	github.com/hashicorp/terraform-provider-aws/internal/service/quicksight	50.449s
FAIL
make: *** [testacc] Error 1
```
I did some checking around the only difference between the original table and the flatten version is that one of them has default upload_settings (set by AWS) while the other does not. Upload settings is marked as computed so I'm not sure why these are being counted in the test. Any thoughts?